dot.emacs.d/config/config.org

#+title: Emacs - Configuration
#+property: header-args:emacs-lisp  :mkdirp yes :lexical t :exports code
#+property: header-args:emacs-lisp+ :tangle ../init.el
#+property: header-args:emacs-lisp+ :mkdirp yes :noweb no-export

This is my emacs configuration. It is based on a [[https://blog.dornea.nu/2024/02/22/from-doom-to-vanilla-emacs/][Blogpost]] by Victor Dorneanu and the emacs config from [[https://config.phundrak.com/emacs/][phundrak]].

* Code Blocks
:PROPERTIES:
:header-args:emacs-lisp: :tangle no
:END:
This section is used to create reusable codeblocks by using the [[https://orgmode.org/manual/Noweb-Reference-Syntax.html][Noweb-Syntax]].

** Example
#+name: foo
#+begin_src emacs-lisp
  (print "foo")
#+end_src

#+name: foobar
#+begin_src org
<<foo>>
#+end_src

** Platform
#+name: platform_windows
#+begin_src emacs-lisp
  when (or (eq system-type 'windows-nt) (eq system-type 'ms-dos))
#+end_src

#+name: platform_linux
#+begin_src emacs-lisp
  when (eq system-type 'gnu/linux)
#+end_src
** Colors
#+name: main_foreground
#+begin_src emacs-lisp
"#D2B48C"
#+end_src

#+name: alt_foreground
#+begin_src emacs-lisp
"#625D52"
#+end_src

#+name: main_background
#+begin_src emacs-lisp
"#012326"
#+end_src

#+name: alt_background
#+begin_src emacs-lisp
"#013137"
#+end_src

#+name: fringe
#+begin_src emacs-lisp
"#01282D"
#+end_src

#+name: comment
#+begin_src emacs-lisp
"#31B72C"
#+end_src

#+name: constant
#+begin_src emacs-lisp
"#65D6AD"
#+end_src

#+name: keyword
#+begin_src emacs-lisp
"#E8E6E1"
#+end_src

#+name: string
#+begin_src emacs-lisp
"#2CB1BC"
#+end_src

#+name: select
#+begin_src emacs-lisp
"#24335E"
#+end_src
** Keybinds
*** CC-Mode
#+name: cc-mode-keys
#+begin_src emacs-lisp
  :bind (
    :map c++-mode-map
    ("TAB" . 'dabbrev-expand)
    ("C-c TAB" . 'indent-region)
    )
#+end_src

*** Consult
#+name: consult-keys
#+begin_src emacs-lisp
  :bind (;; C-c bindings in `mode-specific-map'
         :map mode-specific-map
         ("M-x" . consult-mode-command)
         ("h" . consult-history)
         ("k" . consult-kmacro)
         ("m" . consult-man)
         ("i" . consult-info)
         ([remap Info-search] . consult-info)
         ;; C-x bindings in `ctl-x-map'
         ;;:map ctl-x-map
         ;;("M-:" . consult-complex-command)     ;; orig. repeat-complex-command
         :map global-map
         ;; Custom M-# bindings for fast register access
         ("M-# l" . consult-register-load)
         ("M-# s" . consult-register-store)          ;; orig. abbrev-prefix-mark (unrelated)
         ("M-# #" . consult-register)
         ;; Other custom bindings
         ("M-y" . consult-yank-pop)                ;; orig. yank-pop
         ;; C-x j bindings in `goto-map'
         :map goto-map
         ("e" . consult-compile-error)
         ;;        ("M-G f" . consult-flymake)               ;; Alternative: consult-flycheck
         ("g" . consult-ripgrep)             ;; orig. ripgrep
         ("l" . consult-goto-line)           ;; orig. goto-line
         ("o" . consult-outline)               ;; Alternative: consult-org-heading
         ("m" . consult-mark)
         ("M" . consult-global-mark)
         ("b" . consult-bookmark)
         ("i" . consult-imenu)
         ("I" . consult-imenu-multi)
         ;; C-x s bindings in `search-map'
         :map search-map
         ("d" . consult-find)                  ;; Alternative: consult-fd
         ("c" . consult-locate)
         ("f" . consult-fd)
         ("g" . consult-grep)
         ("G" . consult-git-grep)
         ("r" . consult-ripgrep)
         ("l" . consult-line)
         ("L" . consult-line-multi)
         ("k" . consult-keep-lines)
         ("u" . consult-focus-lines)
         ;; Isearch integration
         ;; ("i" . consult-isearch-history)
         ;; :map isearch-mode-map
         ;; ("i" . consult-isearch-history)         ;; orig. isearch-edit-string
         ;; ("e" . consult-isearch-history)       ;; orig. isearch-edit-string
         ("l" . consult-line)                  ;; needed by consult-line to detect isearch
         ("L" . consult-line-multi)            ;; needed by consult-line to detect isearch
         ;; Minibuffer history
         :map minibuffer-local-map
         ("M-s" . consult-history)                 ;; orig. next-matching-history-element
         ("M-r" . consult-history)                ;; orig. previous-matching-history-element
         :map consult-narrow-map
         ("?" . consult-narrow-help)
         )
#+end_src
*** Embark
#+name: embark-keys
#+begin_src emacs-lisp
  :bind (("C-M-x" . embark-act)
         :map minibuffer-local-map
         ("C-c C-c" . embark-collect)
         ("C-c C-e" . embark-export))

#+end_src
*** Vertico
#+name: vertico-directory-keys
#+begin_src emacs-lisp
  :bind (:map vertico-multiform-map
              ("S-TAB" . vertico-multiform-buffer)
              ("S-<tab>" . vertico-multiform-buffer))
#+end_src

#+name: vertico-directory-keys
#+begin_src emacs-lisp
  :bind (:map vertico-map
              ("RET" . vertico-directory-enter)
              ("DEL" . vertico-directory-delete-char)
              ("M-DEL" . vertico-directory-delete-word))

#+end_src
*** wgrep
#+name: wgrep-keys
#+begin_src emacs-lisp
  :bind ( :map grep-mode-map
                  ("e" . wgrep-change-to-wgrep-mode)
                  ("C-c C-c" . wgrep-finish-edit)
                  )
#+end_src

*** Magit
#+name: magit-keys
#+begin_src emacs-lisp :noweb yes
  :bind (
           ("C-x g s" . 'magit-status)
           ("C-x g b" . 'magit-blame)
           ("C-x g d" . 'magit-diff)
           :map magit-mode-map
           ("C-q" . 'magit-copy-buffer-revision)
           <<emacs-keys-essential>>
           )

#+end_src
*** Org
#+name: org-keys
#+begin_src emacs-lisp
  :bind(
        ("C-c a" . org-agenda)
        ;;("C-c x" . org-archive-subtree)
        ("C-c c" . org-capture)
        ;;("M-p" . org-priority)
        ;;("M-r" . org-refile)
        ;;("M-s" . org-schedule)
        ;;("M-d" . org-deadline)
        )
        #+end_src
**** Org Roam
#+name: org-roam-keys :tabgle no
#+begin_src emacs-lisp
  :bind (
         ("C-c o b" . org-roam-buffer-toggle)
         ("C-c o f" . org-roam-node-find)
         ("C-c o i" . org-roam-node-insert)
         )
#+end_src
**** Denote
#+name: denote-keys
#+begin_src emacs-lisp
  :bind (
         ("C-c n n" . denote)
         ("C-c n r" . denote-rename-file)
         ("C-c n l" . denote-link)
         ("C-c n b" . denote-backlinks)
         ;; ("C-c n c" . denote-region)
         ;; ("C-c n N" . denote-type)
         ;; ("C-c n d" . denote-date)
         ;;  ("C-c n z" . denote-signature)
         ;;  ("C-c n s" . denote-subdirectory)
         ;;  ("C-c n t" . denote-template)
         ;;
         ;;
         ;;
         ;;  ("C-c n f f" . denote-find-link)
         ;;  ("C-c n f b" . denote-find-backlink)
         ;;  ("C-c n r" . denote-rename-file)
         ;;  ("C-c n R" . denote-rename-file-using-front-matter))
         ;; (:map dired-mode-map
         ;;  ("C-c C-d C-i" . denote-dired-link-marked-notes)
         ;;  ("C-c C-d C-r" . denote-dired-rename-files)
         ;;  ("C-c C-d C-k" . denote-dired-rename-marked-files-with-keywords)
         ;;  ("C-c C-d C-R" . denote-dired-rename-marked-files-using-front-matter)
         )
#+end_src

#+name: denote-menu-keys
#+begin_src emacs-lisp
  :bind (
         ("C-c n d" . list-denotes)
         :map denote-menu-mode-map
         ("c" . denote-menu-clear-filters)
         ("f" . denote-menu-filter)
         ("k" . denote-menu-filter-by-keyword)
         ("o"  . denote-menu-filter-out-keyword)
         ("e" . denote-menu-export-to-dired)
         )
#+end_src
*** Emacs
Keys we always want to enforce in different modes aswell. *Be careful with those. They might override other functionalities*.

#+name: emacs-keys-essential
#+begin_src emacs-lisp
  ("M-f" . 'find-file)
  ("M-F" . 'find-file-other-window)
  ("M-b" . 'consult-buffer)
  ("M-B" . 'consult-buffer-other-window)
  ("M-w" . 'other-window)
  #+end_src

#+name: emacs-keys
#+begin_src emacs-lisp :noweb yes
  :bind-keymap
  ("C-x j" . goto-map)
  ("C-x s" . search-map)

  :bind
  <<emacs-keys-essential>>
  ("M-g" . 'consult-ripgrep)

  ("M-s" . 'save-buffer)
  ("M-u" . 'undo)
  ("M-j" . 'consult-imenu)
  ("C-q" . 'copy-region-as-kill)
  ("C-w" . 'kill-region)
  ("M->" . 'mc/mark-next-like-this)
  ("M-<" . 'mc/mark-previous-like-this)
  ("M-m" . 'make-without-asking)

  ("TAB" . 'dabbrev-expand)
  ("C-x C-b" . 'ibuffer)

  ("C-x RET" . 'top-mode)
#+end_src

*** Projects
#+name: project-keys
#+begin_src emacs-lisp
  :bind-keymap
  ("C-x p" . project-prefix-map)
#+end_src
*** Vterm
#+name: vterm-keys
#+begin_src emacs-lisp :noweb yes
  :bind (
         :map vterm-mode-map
         ("C-c C-k" . vterm-copy-mode)
         <<emacs-keys-essential>>
         )
#+end_src
*** Eat
#+name: eat-keys
#+begin_src emacs-lisp :noweb yes
  :bind (
         :map eat-semi-char-mode-map
         ("C-c C-k" . eat-emacs-mode)
         <<emacs-keys-essential>>
         )
#+end_src
*** Top-Mode
#+name: top-mode-keys
#+begin_src emacs-lisp
  :bind (:map top-mode-map
              ("a" . execute-extended-command)
              ("M-a" . consult-mode-command)
              ("RET" . top-mode)
              ("i" . previous-line)
              ("k" . next-line)
              ("j" . backward-char)
              ("l" . forward-char)
              ("u" . backward-word)
              ("o" . forward-word)
              ("h" . backward-paragraph)
              (";" . forward-paragraph)
              ("n a" . org-agenda)
              ("n c" . org-capture)
              ("n d" . list-denotes)
              ("C-c c" . copy-region-as-kill)
              ("C-c x" . kill-region)
              ("C-c v" . consult-yank-pop)
              ("TAB" . consult-buffer)
              ))

#+end_src
* Basic Configuration
** Early Init
:PROPERTIES:
:header-args:emacs-lisp: :tangle ../early-init.el :mkdirp yes
:header-args:emacs-lisp+: :exports code :results silent :lexical t
:END:

The early init file is the file loaded before anything else in Emacs. This is where I put some options in order to disable as quickly as possible some built-in features of Emacs before they can be even loaded, speeding Emacs up a bit.

#+begin_src emacs-lisp
  (setq package-enable-at-startup nil
        inhibit-startup-message   t
        frame-resize-pixelwise    t  ; fine resize
        package-native-compile    t) ; native compile packages
  (scroll-bar-mode -1)               ; disable scrollbar
  (tool-bar-mode -1)                 ; disable toolbar
  (tooltip-mode -1)                  ; disable tooltips
  (set-fringe-mode 10)               ; give some breathing room
  (menu-bar-mode -1)                 ; disable menubar
  (blink-cursor-mode 0)              ; disable blinking cursor

  (setq frame-inhibit-implied-resize t)
  (setq inhibit-compacting-font-caches t)

  (setq shift-select-mode nil)
  (setq enable-local-variables nil)
  (setq column-number-mode t)

#+end_src

*** Defer garbage collection
Defer garbage collection further back in the startup process, according to [[https://github.com/hlissner/doom-emacs/blob/develop/docs/faq.org#how-does-doom-start-up-so-quickly][hlissner]].

#+BEGIN_QUOTE
The GC eats up quite a bit of time, easily doubling startup time. The trick is to turn up the memory threshold as early as possible.
#+END_QUOTE

#+begin_src emacs-lisp
  (setq gc-cons-threshold most-positive-fixnum)
#+end_src

*** Unset =file-name-handler-alist=
Every file opened and loaded by Emacs will run through this list to check for a proper handler for the file, but during startup, it won't need any of them.

#+begin_src emacs-lisp
  (defvar file-name-handler-alist-original file-name-handler-alist)
  (setq file-name-handler-alist nil)
#+end_src
*** Disable =site-run-file=
#+begin_src emacs-lisp
  (setq site-run-file nil)
#+end_src

** Undo
Stop Emacs from losing undo information by setting very high limits for undo buffers.

#+begin_src emacs-lisp
  (setq undo-limit 20000000)
  (setq undo-strong-limit 40000000)
#+end_src

** Garbage Collection
*** Set =gc-cons-threshold= Smaller for Interactive Use
A large =gc-cons-threshold= may cause freezing and stuttering during long-term interactive use.
If you experience freezing, decrease this amount, if you experience stuttering, increase this amount.

#+begin_src emacs-lisp
  (defvar better-gc-cons-threshold (* 128 1024 1024) ; 128mb
    "The default value to use for `gc-cons-threshold'.

  If you experience freezing, decrease this.  If you experience stuttering, increase this.")

  (add-hook 'emacs-startup-hook
            (lambda ()
              (setq gc-cons-threshold better-gc-cons-threshold)
              (setq file-name-handler-alist file-name-handler-alist-original)
              (makunbound 'file-name-handler-alist-original)))
#+end_src

Garbage Collect when Emacs is out of focus and avoid garbage collection when using minibuffer.

#+begin_src emacs-lisp
  (add-hook 'emacs-startup-hook
            (lambda ()
              (if (boundp 'after-focus-change-function)
                  (add-function :after after-focus-change-function
                                (lambda ()
                                  (unless (frame-focus-state)
                                    (garbage-collect))))
                (add-hook 'after-focus-change-function 'garbage-collect))
              (defun gc-minibuffer-setup-hook ()
                (setq gc-cons-threshold (* better-gc-cons-threshold 2)))

              (defun gc-minibuffer-exit-hook ()
                (garbage-collect)
                (setq gc-cons-threshold better-gc-cons-threshold))

              (add-hook 'minibuffer-setup-hook #'gc-minibuffer-setup-hook)
              (add-hook 'minibuffer-exit-hook #'gc-minibuffer-exit-hook)))
#+end_src

** Stay Clean, Emacs!
As nice as Emacs is, it isn't very polite or clean by default: open a file, and it will create backup files in the same directory. But then, when you open your directory with your favourite file manager and see almost all of your files duplicated with a =~= appended to the filename, it looks really uncomfortable! This is why I prefer to tell Emacs to keep its backup files to itself in a directory it only will access.
#+begin_src emacs-lisp
  (setq backup-directory-alist `(("." . ,(expand-file-name ".tmp/backups/"
                                                           user-emacs-directory))))
#+end_src

