dot.emacs.d/config/config.org
** Vertico
This is mostly the default config from [[https://github.com/minad/vertico][here]].

#+begin_src emacs-lisp
  (use-package vertico
    :ensure t
    <<vertico-keys>>
    ;; :custom
    ;; (vertico-scroll-margin 0) ;; Different scroll margin
    ;; (vertico-count 20) ;; Show more candidates
    ;; (vertico-resize t) ;; Grow and shrink the Vertico minibuffer
    ;; (vertico-cycle t) ;; Enable cycling for `vertico-next/previous'
    :init
    (vertico-mode))
  (vertico-multiform-mode)
  (vertico-flat-mode)

  ;; A few more useful configurations...
  (use-package emacs
    :custom
    ;; Support opening new minibuffers from inside existing minibuffers.
    (enable-recursive-minibuffers t)
    ;; Hide commands in M-x which do not work in the current mode.  Vertico
    ;; commands are hidden in normal buffers. This setting is useful beyond
    ;; Vertico.
    (read-extended-command-predicate #'command-completion-default-include-p)
    :init
    ;; Add prompt indicator to `completing-read-multiple'.
    ;; We display [CRM<separator>], e.g., [CRM,] if the separator is a comma.
    (defun crm-indicator (args)
      (cons (format "[CRM%s] %s"
                    (replace-regexp-in-string
                     "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                     crm-separator)
                    (car args))
            (cdr args)))
    (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

    ;; Do not allow the cursor in the minibuffer prompt
    (setq minibuffer-prompt-properties
          '(read-only t cursor-intangible t face minibuffer-prompt))
    (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)
    (add-hook 'rfn-eshadow-update-overlay-hook #'vertico-directory-tidy))
#+end_src

*** Vertico Directory
#+begin_src emacs-lisp
  (use-package vertico-directory
    :after vertico
    :ensure nil
    ;; More convenient directory navigation commands
    <<vertico-directory-keys>>
    ;; Tidy shadowed file names
    :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))
#+end_src
** Dumb Jump
#+begin_src emacs-lisp
  (use-package dumb-jump
    :ensure t
    :custom
    (dumb-jump-prefer-searcher 'rg)
    ;; (xref-show-definitions-function #'xref-show-definitions-completing-read)
    (xref-show-definitions-function #'consult-xref))
  (add-hook 'xref-backend-functions #'dumb-jump-xref-activate)
#+end_src
** Misc
*** Marks
Make Emacs repeat the C-u C-SPC command (`set-mark-command') by following it up with another C-SPC. It is faster to type C-u C-SPC, C-SPC, C-SPC, than C-u C-SPC, C-u C-SPC, C-u C-SPC...

#+begin_src emacs-lisp
  (setq set-mark-command-repeat-pop t)
#+end_src
*** Multi Cursor
#+begin_src emacs-lisp
  (use-package multiple-cursors :ensure t)
#+end_src
* Programming
** C

#+begin_src emacs-lisp
  (use-package cc-mode
    :defer t
    <<cc-mode-keys>>
    :config

    ;; 4-space tabs
    (setq tab-width 4)
    (setq c-basic-offset 4)

    ;; No hungry backspace
    (c-toggle-auto-hungry-state -1)

    ;; Additional style stuff
    (setq c-offsets-alist '(
                            (member-init-intro . ++)
                            (case-label . +)
                            ))
    ;; Newline indents, semi-colon doesn't
    ;; (define-key c++-mode-map "\C-m" 'newline-and-indent)
    (setq c-hanging-semi&comma-criteria '((lambda () 'stop)))

    ;; Handle super-tabbify (TAB completes, shift-TAB actually tabs)
    (setq dabbrev-case-replace t)
    (setq dabbrev-case-fold-search t)
    (setq dabbrev-upcase-means-case-search t)

    ;; Abbrevation expansion
    (abbrev-mode 1)

    ;; if indent-tabs-mode is off, untabify before saving
    (add-hook 'write-file-hooks
              (lambda () (if (not indent-tabs-mode)
                             (untabify (point-min) (point-max)))
                nil ))

    )
#+end_src
** Device-Tree
#+begin_src emacs-lisp
  (use-package dts-mode
    :ensure t
    :mode (
           ("\\.dts$" . dts-mode)
           ("\\.dtsi$" . dts-mode)
           ("\\.dtso$" . dts-mode)
           ))
#+end_src

** Go
#+begin_src emacs-lisp
  (use-package go-mode
    :ensure t
    :mode ("\\.go$" . go-mode)
    )
#+end_src

** Lua
#+begin_src emacs-lisp
  (use-package lua-mode
    :ensure t
    :mode ("\\.lua$" . lua-mode)
    )
#+end_src

** YAML
#+begin_src emacs-lisp
  (use-package yaml-mode
    :ensure t
    :mode (
           ("\\.yml$" . yaml-mode)
           ("\\.yaml$" . yaml-mode)
           )
    )
#+end_src
** Markdown
#+begin_src emacs-lisp
  (use-package markdown-mode
    :ensure t
    :mode ("\\.md$" . markdown-mode))
#+end_src
** Spellcheck
For spellcheck we are using hunspell. Make sure it is installed on the system and the dictionaries de_DE and en_US are installed.

The default dict is set to en_US.
#+begin_src emacs-lisp
  (setq ispell-program-name "hunspell")
  (setq ispell-dictionary "en_US")

  (setq ispell-dictionary-alist
        '(("de_DE" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "de_DE") nil utf-8)
          ("en_US" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "en_US") nil utf-8)
          ))

  ;; new variable `ispell-hunspell-dictionary-alist' is defined in Emacs
  ;; If it's nil, Emacs tries to automatically set up the dictionaries.
  (if (boundp 'ispell-hunspell-dictionary-alist) t
    (setq ispell-hunspell-dictionary-alist ispell-dictionary-alist))
#+end_src

** Syntax Highlight
#+begin_src emacs-lisp
  (autoload 'bb-mode            "bb-mode"         "Bitbake mode"                                         t)

  (setq auto-mode-alist
        (append '(
                  ("\\workspace.dsl$" . javascript-mode)
                  ("\\.teak$"     . c++-mode)
                  ("\\.cpp$"      . c++-mode)
                  ("\\.hin$"      . c++-mode)
                  ("\\.cin$"      . c++-mode)
                  ("\\.inl$"      . c++-mode)
                  ("\\.rdc$"      . c++-mode)
                  ("\\.h$"        . c++-mode)
                  ("\\.c$"        . c++-mode)
                  ("\\.cc$"       . c++-mode)
                  ("\\.c8$"       . c++-mode)
                  ("\\.txt$"      . indented-text-mode)
                  ("\\.emacs$"    . emacs-lisp-mode)
                  ("\\.gen$"      . gen-mode)
                  ("\\.ms$"       . fundamental-mode)
                  ("\\.m$"        . objc-mode)
                  ("\\.mm$"       . objc-mode)
                  ("\\.bb$"       . bb-mode)
                  ("\\.inc$"      . bb-mode)
                  ("\\.bbappend$" . bb-mode)
                  ("\\.bbclass$"  . bb-mode)
                  ("\\.conf$"     . bb-mode)
                  ("\\.js$"       . javascript-mode)
                  ("\\.json$"     . javascript-mode)

                  ) auto-mode-alist))

#+end_src
** Tabs vs Spaces
Here we define which modes should use tabs and which should use spaces.

#+begin_src emacs-lisp :tangle no
  (add-hook 'c++-mode-hook        'dgl/unset-tabs-mode)
  (add-hook 'prog-mode-hook       'dgl/set-tabs-mode)
  (add-hook 'emacs-lisp-mode-hook 'dgl/set-tabs-mode)
  (add-hook 'org-mode-hook        'dgl/set-tabs-mode)
#+end_src

We also want to remove any trailing whitespace to keep things clean
#+begin_src emacs-lisp
  (add-hook 'write-file-hooks 'delete-trailing-whitespace)
#+end_src

*** Set and unset tabs mode
#+begin_src emacs-lisp

  (defun dgl/set-tabs-mode ()
    "Enable tabs mode"
    (interactive)
    (setq indent-tabs-mode t)
    (message "Tabs enabled."))

  (defun dgl/unset-tabs-mode ()
    "Enable tabs mode"
    (interactive)
    (setq indent-tabs-mode nil)
    (message "Tabs disabled."))

#+end_src

The current mode should also be visible in the modeline

#+begin_src emacs-lisp
  (defun dgl/tabs-mode-indicator ()
    "Return 'TAB' if indent-tabs-mode is enabled, otherwise return 'SPC'."
    (if indent-tabs-mode " [TAB]" " [SPC]"))

  (setq-default mode-line-format
                (append mode-line-format
                        '((:eval (dgl/tabs-mode-indicator)))))
#+end_src
*** Automatic detection
#+begin_src emacs-lisp
  (setq-default indent-tabs-mode nil)
  (use-package dtrt-indent
    :ensure t
    :config
    (dtrt-indent-global-mode)
    )
#+end_src

