dot.emacs.d/init.el
  ;; (vertico-scroll-margin 0) ;; Different scroll margin
  ;; (vertico-count 20) ;; Show more candidates
  ;; (vertico-resize t) ;; Grow and shrink the Vertico minibuffer
  ;; (vertico-cycle t) ;; Enable cycling for `vertico-next/previous'
  :init
  (vertico-mode))
(vertico-multiform-mode)
(vertico-flat-mode)

;; A few more useful configurations...
(use-package emacs
  :custom
  ;; Support opening new minibuffers from inside existing minibuffers.
  (enable-recursive-minibuffers t)
  ;; Hide commands in M-x which do not work in the current mode.  Vertico
  ;; commands are hidden in normal buffers. This setting is useful beyond
  ;; Vertico.
  (read-extended-command-predicate #'command-completion-default-include-p)
  :init
  ;; Add prompt indicator to `completing-read-multiple'.
  ;; We display [CRM<separator>], e.g., [CRM,] if the separator is a comma.
  (defun crm-indicator (args)
    (cons (format "[CRM%s] %s"
                  (replace-regexp-in-string
                   "\\`\\[.*?]\\*\\|\\[.*?]\\*\\'" ""
                   crm-separator)
                  (car args))
          (cdr args)))
  (advice-add #'completing-read-multiple :filter-args #'crm-indicator)

  ;; Do not allow the cursor in the minibuffer prompt
  (setq minibuffer-prompt-properties
        '(read-only t cursor-intangible t face minibuffer-prompt))
  (add-hook 'minibuffer-setup-hook #'cursor-intangible-mode)
  (add-hook 'rfn-eshadow-update-overlay-hook #'vertico-directory-tidy))

(use-package vertico-directory
  :after vertico
  :ensure nil
  ;; More convenient directory navigation commands
  :bind (:map vertico-multiform-map
              ("S-TAB" . vertico-multiform-buffer)
              ("S-<tab>" . vertico-multiform-buffer))
  ;; Tidy shadowed file names
  :hook (rfn-eshadow-update-overlay . vertico-directory-tidy))

(use-package dumb-jump
:ensure t
:custom
(dumb-jump-prefer-searcher 'rg)
;; (xref-show-definitions-function #'xref-show-definitions-completing-read)
(xref-show-definitions-function #'consult-xref))
(add-hook 'xref-backend-functions #'dumb-jump-xref-activate)

(setq set-mark-command-repeat-pop t)

(use-package multiple-cursors :ensure t)

(use-package cc-mode
  :defer t
  :bind (
    :map c++-mode-map
    ("TAB" . 'dabbrev-expand)
    ("C-c TAB" . 'indent-region)
    )
  :config

  ;; 4-space tabs
  (setq tab-width 4)
  (setq c-basic-offset 4)

  ;; No hungry backspace
  (c-toggle-auto-hungry-state -1)

  ;; Additional style stuff
  (setq c-offsets-alist '(
                          (member-init-intro . ++)
                          (case-label . +)
                          ))
  ;; Newline indents, semi-colon doesn't
  ;; (define-key c++-mode-map "\C-m" 'newline-and-indent)
  (setq c-hanging-semi&comma-criteria '((lambda () 'stop)))

  ;; Handle super-tabbify (TAB completes, shift-TAB actually tabs)
  (setq dabbrev-case-replace t)
  (setq dabbrev-case-fold-search t)
  (setq dabbrev-upcase-means-case-search t)

  ;; Abbrevation expansion
  (abbrev-mode 1)

  ;; if indent-tabs-mode is off, untabify before saving
  (add-hook 'write-file-hooks
            (lambda () (if (not indent-tabs-mode)
                           (untabify (point-min) (point-max)))
              nil ))

  )

(use-package dts-mode
  :ensure t
  :mode (
		 ("\\.dts$" . dts-mode)
		 ("\\.dtsi$" . dts-mode)
		 ("\\.dtso$" . dts-mode)
		 ))

(use-package go-mode
  :ensure t
  :mode ("\\.go$" . go-mode)
  )

(use-package lua-mode
  :ensure t
  :mode ("\\.lua$" . lua-mode)
  )

(use-package yaml-mode
  :ensure t
  :mode (
	   ("\\.yml$" . yaml-mode)
	   ("\\.yaml$" . yaml-mode)
	   )
  )

(use-package markdown-mode
  :ensure t
  :mode ("\\.md$" . markdown-mode))

(setq ispell-program-name "hunspell")
(setq ispell-dictionary "en_US")

(setq ispell-dictionary-alist
      '(("de_DE" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "de_DE") nil utf-8)
        ("en_US" "[[:alpha:]]" "[^[:alpha:]]" "[']" nil ("-d" "en_US") nil utf-8)
        ))

;; new variable `ispell-hunspell-dictionary-alist' is defined in Emacs
;; If it's nil, Emacs tries to automatically set up the dictionaries.
(if (boundp 'ispell-hunspell-dictionary-alist) t
  (setq ispell-hunspell-dictionary-alist ispell-dictionary-alist))

(autoload 'bb-mode            "bb-mode"         "Bitbake mode"                                         t)

(setq auto-mode-alist
      (append '(
                ("\\workspace.dsl$" . javascript-mode)
                ("\\.teak$"     . c++-mode)
                ("\\.cpp$"      . c++-mode)
                ("\\.hin$"      . c++-mode)
                ("\\.cin$"      . c++-mode)
                ("\\.inl$"      . c++-mode)
                ("\\.rdc$"      . c++-mode)
                ("\\.h$"        . c++-mode)
                ("\\.c$"        . c++-mode)
                ("\\.cc$"       . c++-mode)
                ("\\.c8$"       . c++-mode)
                ("\\.txt$"      . indented-text-mode)
                ("\\.emacs$"    . emacs-lisp-mode)
                ("\\.gen$"      . gen-mode)
                ("\\.ms$"       . fundamental-mode)
                ("\\.m$"        . objc-mode)
                ("\\.mm$"       . objc-mode)
                ("\\.bb$"       . bb-mode)
                ("\\.inc$"      . bb-mode)
                ("\\.bbappend$" . bb-mode)
                ("\\.bbclass$"  . bb-mode)
                ("\\.conf$"     . bb-mode)
                ("\\.js$"       . javascript-mode)
                ("\\.json$"     . javascript-mode)

                ) auto-mode-alist))

(add-hook 'c++-mode-hook        'dgl/unset-tabs-mode)
(add-hook 'prog-mode-hook       'dgl/set-tabs-mode)
(add-hook 'emacs-lisp-mode-hook 'dgl/set-tabs-mode)
(add-hook 'org-mode-hook        'dgl/set-tabs-mode)

(add-hook 'write-file-hooks 'delete-trailing-whitespace)

(when (or (eq system-type 'windows-nt) (eq system-type 'ms-dos))
