dot.emacs.d/config/config.org
** GTD
We setup org-mode to be able to follow the GTD system.

#+begin_src emacs-lisp
  (use-package org
    :config
    (setq org-agenda-files (list dgl/org-directory dgl/org-roam-directory))
    (setq org-refile-targets
          '(
            (org-agenda-files :maxlevel . 5)
            ))
    (setq org-archive-location (concat dgl/org-directory "/archive.org::datetree/* Finished Tasks"))
    (setq org-log-done 'time)
    (setq org-todo-keywords
          '((sequence "TODO(t)" "WAIT(w)" "NEXT(n)" "|" "DONE(d)" "CANC(c)")))
    (setq org-return-follows-link t)
    (setq org-agenda-custom-commands '(
                                       ("t" "TODOs" tags-todo "+TODO=\"TODO\"-PROJECT")
                                       ("i" "Inbox TODOs" tags-todo "+INBOX-KEEP")
                                       ("w" "Waiting Tasks" tags-todo "+TODO=\"WAIT\"-PROJECT")
                                       ("n" "Next Tasks" tags-todo "+TODO=\"NEXT\"-PROJECT")
                                       ("s" "Someday" tags-todo "+TODO=\"TODO\"+SOMEDAY")
                                       ))
    (setq org-agenda-sorting-strategy
          '((agenda habit-down time-up priority-down category-keep)
            (todo priority-down todo-state-up category-keep)
            (tags priority-down todo-state-up category-keep)
            (search category-keep)))

    (setq org-capture-templates
          `(
            ("i" "Inbox" entry
             (file, (concat dgl/org-directory "/inbox.org"))
             "* TODO %^{Brief Description}\nAdded: %U\nContext: %a\n%?" :empty-lines 1 :prepend t)

            ("n" "Next action" entry
             (file, (concat dgl/org-directory "/gtd.org"))
             "** NEXT [%^{Prio|#B|#A|#C}] %^{Brief Description}\nAdded: %U\n%?" :empty-lines 1 :prepend t)

            ("w" "Waiting" entry
             (file, (concat dgl/org-directory "/gtd.org"))
             "** WAIT %^{Brief Description}\nAdded: %U\n%?" :empty-lines 1 :prepend t)

            ("s" "Someday" entry
             (file, (concat dgl/org-directory "/someday.org"))
             "* TODO %^{Brief Description}\nAdded: %U\n%f\n%?" :empty-lines 1 :prepend t)
            ))
    )
#+end_src

#+begin_src emacs-lisp
  (defun dgl/gtd ()
    (interactive)
    (find-file (concat dgl/org-directory "/gtd.org"))
    )
#+end_src
* Misc

** Pinentry
Pinentry does not really work, especially in combination with magit. I don't want to use the normal graphical app because it will fail when using a ssh connection.
Recently I found this [[https://github.com/magit/magit/issues/4076][issue]].

NOTE: it is important to update the gnupg configs:

#+name ~/.gnupg/gpg.conf
#+begin_src linux :tangle no
  pinentry-mode loopback
#+end_src

#+name ~/.gnupg/gpg-agent.conf
#+begin_src linux :tangle no
  pinentry-program /usr/bin/pinentry-tty
  allow-loopback-pinentry
#+end_src

#+begin_src emacs-lisp
  (use-package emacs
    :config
    (setq epa-pinentry-mode 'loopback)
    )
#+end_src
** Tramp
We usually use bash when working on remote machines.

#+begin_src emacs-lisp
  (use-package tramp
    :defer t
    :custom
    ;; We use ssh controlmaster in our ssh config and in the putty session
    (tramp-use-connection-share nil)
    :config
    (connection-local-set-profile-variables
     'remote-direct-async-process
     '((tramp-direct-async-process . t)))

    (connection-local-set-profiles
     '(:application tramp :protocol "ssh")
     'remote-direct-async-process)

    (connection-local-set-profiles
     '(:application tramp :protocol "sshx")
     'remote-direct-async-process)

    (connection-local-set-profiles
     '(:application tramp :protocol "plink")
     'remote-direct-async-process)

    (connection-local-set-profiles
     '(:application tramp :protocol "plinkx")
     'remote-direct-async-process)

    (connection-local-set-profiles
     '(:application tramp :protocol "scp")
     'remote-direct-async-process)

    (connection-local-set-profiles
     '(:application tramp :protocol "scpx")
     'remote-direct-async-process)

    (connection-local-set-profiles
     '(:application tramp :protocol "rsync")
     'remote-direct-async-process)

    (setq tramp-default-method "ssh")
    (setq remote-file-name-inhibit-locks t)
    (setq remote-file-name-inhibit-cache 180)
    (setq tramp-completion-reread-directory-timeout 180)
    (setq tramp-directory-cache-expire (* 60 60 24))
    (setq tramp-auto-save-directory nil)
    (setq vc-ignore-dir-regexp (format "%s\\|%s"
                                       vc-ignore-dir-regexp
                                       tramp-file-name-regexp))
    (setq tramp-ssh-controlmaster-options nil)
    (setq tramp-connection-timeout 10)
    (setq tramp-verbose 1)
    )
#+end_src

*** Eshell
We usually use a remote shell when connecting to other systems.

#+begin_src emacs-lisp
  (use-package eshell
    :defer t
    :config
    (add-to-list 'eshell-modules-list 'eshell-tramp)
    (add-to-list 'eshell-modules-list 'eshell-smart)
    )
#+end_src
*** VTerm
Eshell is not the best when needing a full terminal. However vterm only works on linux

#+begin_src emacs-lisp
  (use-package vterm
    :defer t
    :ensure t
    <<vterm-keys>>
    :custom
    (vterm-always-compile-module t)
    (vterm-max-scrollback 10000)
    (vterm-buffer-name-string "vterm %s")
    )
#+end_src
*** Eat
Eat is fully written in lisp and better then term. Therefore it will also work on windows.

#+begin_src emacs-lisp :tangle no
  (use-package eat
    :defer t
    :ensure t
    <<eat-keys>>
    :hook (eshell-mode . eat-eshell-mode)
    :config
    (setq eat-term-scrollback-size 1048576)
    )
#+end_src

Eat is apparently not properly working on windows but there is a patch. Therefore we patched the source manually.

#+begin_src emacs-lisp
  (use-package eat
    :defer t
    :ensure nil
    <<eat-keys>>
    :hook (eshell-mode . eat-eshell-mode)
    :config
    (setq eat-term-scrollback-size 1048576)
    )

  (autoload 'eat            "eat"         "Eat Terminal"                 t)
  (setq eat-term-scrollback-size 1048576)
#+end_src

** EWW
Lookup with eww first, then use =eww-browse-with-external-browser= if we need to browse in a normal browser
#+begin_src emacs-lisp
  (setq browse-url-browser-function 'eww-browse-url)
  (add-hook 'eww-after-render-hook 'eww-readable)
#+end_src

display eww in side window with a large height
** Modal
I want to have a simple modal mode to simplify movement and some commands. However I want to use default emacs keybindings and explicitly enable this modal mode. The existing modal implementations I have found did too much. Therefore I tried to create my own.

#+begin_src emacs-lisp
  (use-package top-mode
    :ensure nil  ;; No need to install a package for a custom minor mode
    :defer t
    :config
    (setq top-mode-modline-background <<string>>)
    (setq top-mode-modline-foreground <<main_background>>)

    ;; (dolist (top-mode-keep-enabled-cmds '(

    ;;                                       ))
    ;;   (add-to-list 'top-mode-keep-enabled-commands top-mode-keep-enabled-cmds))

    (dolist (top-mode-exit-cmds '(org-agenda
                                  list-denotes
                                  denote))
      (add-to-list 'top-mode-auto-exit-commands top-mode-exit-cmds))

    <<top-mode-keys>>
#+end_src
* OS
** EXWM

Most of the config is taken and adjusted from [[https://github.com/daviwil/emacs-from-scratch/blob/219c060e1bd695948c7691955a12a5dcaf3a9530/Emacs.org#window-management][systemcrafters.net]].

#+begin_src emacs-lisp
  (<<platform_linux>>
   (use-package exwm
     :ensure t
     :config
     ;; Set the initial workspace number.
     (setq exwm-workspace-number 4)

     ;; Automatically move EXWM buffer to current workspace when selected
     (setq exwm-layout-show-all-buffers t)

     ;; Display all EXWM buffers in every workspace buffer list
     (setq exwm-workspace-show-all-buffers t)

     ;; Make class name the buffer name.
     (add-hook 'exwm-update-class-hook
               (lambda () (exwm-workspace-rename-buffer exwm-class-name)))
     ;; These keys should always pass through to Emacs
     (setq exwm-input-prefix-keys
           '(?\C-x
             ?\C-u
             ?\C-h
             ?\C-q     ;; Prevent from accidently closing firefox
             ?\M-J b
             ?\M-b     ;; Buffer list
             ?\M-P p   ;; Project selection
             ?\M-x
             ?\M-w     ;; other window
             ?\M-`
             ?\M-&
             ?\M-:
             ?\C-\ ))  ;; Ctrl+Space

     ;; Global keybindings.
     (setq exwm-input-global-keys
           `(([?\s-r]   . exwm-reset) ;; s-r: Reset (to line-mode). C-c C-k switches to char-mode
             ([?\s-0]   . exwm-workspace-switch) ;; s-w: Switch workspace.
             ([?\s-b]   . exwm-workspace-switch-to-buffer)
             ([?\s-q]   . exwm-input-send-next-key)
             ([?\s-x]   . (lambda (cmd) ;; s-&: Launch application.
                            (interactive (list (read-shell-command "$ ")))
                            (start-process-shell-command cmd nil cmd)))
             ;; s-N: Switch to certain workspace.
             ,@(mapcar (lambda (i)
                         `(,(kbd (format "s-%d" i)) .
                           (lambda ()
                             (interactive)
                             (exwm-workspace-switch-create , (- i 1)))))
                       (number-sequence 1 9))))
     ;; Enable EXWM
     (exwm-enable)
     ))
#+end_src

