dot.emacs.d/init.el
	(setq org-agenda-files (list dgl/org-directory dgl/org-roam-directory))
	(setq org-refile-targets
		  '(
			(org-agenda-files :maxlevel . 5)
			))
	(setq org-archive-location (concat dgl/org-directory "/archive.org::datetree/* Finished Tasks"))
	(setq org-log-done 'time)
	(setq org-todo-keywords
		  '((sequence "TODO(t)" "WAIT(w)" "NEXT(n)" "|" "DONE(d)" "CANC(c)")))
	(setq org-return-follows-link t)
	(setq org-agenda-custom-commands '(
									   ("t" "TODOs" tags-todo "+TODO=\"TODO\"-PROJECT")
									   ("i" "Inbox TODOs" tags-todo "+INBOX-KEEP")
									   ("w" "Waiting Tasks" tags-todo "+TODO=\"WAIT\"-PROJECT")
									   ("n" "Next Tasks" tags-todo "+TODO=\"NEXT\"-PROJECT")
									   ("s" "Someday" tags-todo "+TODO=\"TODO\"+SOMEDAY")
									   ))
	(setq org-agenda-sorting-strategy
	  '((agenda habit-down time-up priority-down category-keep)
		(todo priority-down todo-state-up category-keep)
		(tags priority-down todo-state-up category-keep)
		(search category-keep)))

	(setq org-capture-templates
	  `(
		("i" "Inbox" entry
		 (file, (concat dgl/org-directory "/inbox.org"))
		 "* TODO %^{Brief Description}\nAdded: %U\nContext: %a\n%?" :empty-lines 1 :prepend t)

		("n" "Next action" entry
		 (file, (concat dgl/org-directory "/gtd.org"))
		 "** NEXT [%^{Prio|#B|#A|#C}] %^{Brief Description}\nAdded: %U\n%?" :empty-lines 1 :prepend t)

		("w" "Waiting" entry
		 (file, (concat dgl/org-directory "/gtd.org"))
		 "** WAIT %^{Brief Description}\nAdded: %U\n%?" :empty-lines 1 :prepend t)

		("s" "Someday" entry
		 (file, (concat dgl/org-directory "/someday.org"))
		 "* TODO %^{Brief Description}\nAdded: %U\n%f\n%?" :empty-lines 1 :prepend t)
		))
	)

(defun dgl/gtd ()
  (interactive)
  (find-file (concat dgl/org-directory "/gtd.org"))
)

(use-package emacs
  :config
  (setq epa-pinentry-mode 'loopback)
)

(use-package tramp
  :defer t
  :custom
  ;; We use ssh controlmaster in our ssh config and in the putty session
  (tramp-use-connection-share nil)
  :config
  (connection-local-set-profile-variables
   'remote-direct-async-process
   '((tramp-direct-async-process . t)))

  (connection-local-set-profiles
   '(:application tramp :protocol "ssh")
   'remote-direct-async-process)

  (connection-local-set-profiles
   '(:application tramp :protocol "sshx")
   'remote-direct-async-process)

  (connection-local-set-profiles
   '(:application tramp :protocol "plink")
   'remote-direct-async-process)

  (connection-local-set-profiles
   '(:application tramp :protocol "plinkx")
   'remote-direct-async-process)

  (connection-local-set-profiles
   '(:application tramp :protocol "scp")
   'remote-direct-async-process)

  (connection-local-set-profiles
   '(:application tramp :protocol "scpx")
   'remote-direct-async-process)

  (connection-local-set-profiles
   '(:application tramp :protocol "rsync")
   'remote-direct-async-process)

  (setq tramp-default-method "ssh")
  (setq remote-file-name-inhibit-locks t)
  (setq remote-file-name-inhibit-cache 180)
  (setq tramp-completion-reread-directory-timeout 180)
  (setq tramp-directory-cache-expire (* 60 60 24))
  (setq tramp-auto-save-directory nil)
  (setq vc-ignore-dir-regexp (format "%s\\|%s"
									 vc-ignore-dir-regexp
									 tramp-file-name-regexp))
  (setq tramp-ssh-controlmaster-options nil)
  (setq tramp-connection-timeout 10)
  (setq tramp-verbose 1)
  )

(use-package eshell
  :defer t
  :config
  (add-to-list 'eshell-modules-list 'eshell-tramp)
  (add-to-list 'eshell-modules-list 'eshell-smart)
  )

(setq browse-url-browser-function 'eww-browse-url)
(add-hook 'eww-after-render-hook 'eww-readable)

(when (eq system-type 'gnu/linux)
 (require 'exwm)
 ;; Set the initial workspace number.
 (setq exwm-workspace-number 4)

 ;; Automatically move EXWM buffer to current workspace when selected
 (setq exwm-layout-show-all-buffers t)

 ;; Display all EXWM buffers in every workspace buffer list
 (setq exwm-workspace-show-all-buffers t)

 ;; Make class name the buffer name.
 (add-hook 'exwm-update-class-hook
  		   (lambda () (exwm-workspace-rename-buffer exwm-class-name)))
 ;; These keys should always pass through to Emacs
 (setq exwm-input-prefix-keys
  	   '(?\C-x
  		 ?\C-u
  		 ?\C-h
  		 ?\C-q     ;; Prevent from accidently closing firefox
  		 ?\M-J b
  		 ?\M-b     ;; Buffer list
  		 ?\M-P p   ;; Project selection
  		 ?\M-x
  		 ?\M-w     ;; other window
  		 ?\M-`
  		 ?\M-&
  		 ?\M-:
  		 ?\C-\ ))  ;; Ctrl+Space

 ;; Global keybindings.
 (setq exwm-input-global-keys
       `(([?\s-r]   . exwm-reset) ;; s-r: Reset (to line-mode). C-c C-k switches to char-mode
  		 ([?\s-0]   . exwm-workspace-switch) ;; s-w: Switch workspace.
  		 ([?\s-b]   . exwm-workspace-switch-to-buffer)
  		 ([?\s-q]   . exwm-input-send-next-key)
  		 ([?\s-x]   . (lambda (cmd) ;; s-&: Launch application.
    					(interactive (list (read-shell-command "$ ")))
    					(start-process-shell-command cmd nil cmd)))
  		 ;; s-N: Switch to certain workspace.
  		 ,@(mapcar (lambda (i)
  					 `(,(kbd (format "s-%d" i)) .
  					   (lambda ()
  						 (interactive)
  						 (exwm-workspace-switch-create , (- i 1)))))
  				   (number-sequence 1 9))))
 ;; Enable EXWM
 (exwm-enable)
 )

(when (eq system-type 'gnu/linux)
